app/views/users/edit.html.erb

SELECT "services".* FROM "services" WHERE "services"."user_id" = 4 AND "services"."provider" = 'facebook' LIMIT 1
---
  <script type="text/javascript">
    $(document).ready(function() {
      var tour = $('#tour-blend').tourbus({});
      tour.trigger('depart.tourbus');

      $(".tourbus-stop").click(function() {
        $.ajax({
          type: "GET",
          url: "/tour/update",
          contentType: "application/json; charset=utf-8",
          dataType: "json",
          complete: function() {
            window.location = '/<%= current_user.services.first.try(:provider) %>';
          }
        });
      });
    });