app/controllers/friend_maps_controller.rb

SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND (first_name ilike '%%' or last_name ilike '%%') ORDER BY first_name LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE "users"."deleted_at" IS NULL AND (first_name ilike '%%' or last_name ilike '%%')
SELECT COUNT(*) FROM "friend_maps" WHERE "friend_maps"."user_id" = 1 AND "friend_maps"."is_confirmed" = 'f'
SELECT COUNT(*) FROM "friend_maps" WHERE "friend_maps"."friend_id" = 1 AND "friend_maps"."is_confirmed" = 'f'
---
  def index
    name = "%#{params[:name]}%"
    @search_users = User.where("first_name ilike ? or last_name ilike ?", name, name).order("first_name").page params[:page]
    respond_to do |format|
      format.html do
        @pending_count = FriendMap.where(user_id: current_user.id, is_confirmed: false).count
        @friend_count = FriendMap.where(user_id: current_user.id, is_confirmed: true).count
        @request_count = FriendMap.where(friend_id: current_user.id, is_confirmed: false).count

SELECT "friend_maps".* FROM "friend_maps" WHERE "friend_maps"."user_id" = 1 AND "friend_maps"."is_confirmed" = 'f' LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "friend_maps" WHERE "friend_maps"."user_id" = 1 AND "friend_maps"."is_confirmed" = 'f'
---
  def pending_friends
    @pending_friends = FriendMap.where(user_id: current_user.id, is_confirmed: false).page(params[:page])#.map {|friend| friend.friend }

SELECT "friend_maps".* FROM "friend_maps" WHERE "friend_maps"."user_id" = 1 AND "friend_maps"."is_confirmed" = 't' LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "friend_maps" WHERE "friend_maps"."user_id" = 1 AND "friend_maps"."is_confirmed" = 't'
---
  def friends
    @friends = FriendMap.where(user_id: current_user.id, is_confirmed: true).page(params[:page])#.map {|friend| friend.friend }

SELECT "friend_maps".* FROM "friend_maps" WHERE "friend_maps"."friend_id" = 1 AND "friend_maps"."is_confirmed" = 'f' LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "friend_maps" WHERE "friend_maps"."friend_id" = 1 AND "friend_maps"."is_confirmed" = 'f'
---
  def request_friends
    @request_friends = FriendMap.where(friend_id: current_user.id, is_confirmed: false).page(params[:page])#.map {|friend| friend.user }

SELECT COUNT(*) FROM "photo_urls" WHERE "photo_urls"."user_id" = 1
SELECT "friend_maps"."friend_id" FROM "friend_maps" WHERE "friend_maps"."user_id" = 1
---
  def friends_feed
    @photourls = current_user.photo_urls #to check if user are added image url
    if !session[:tour].eql?(false)
      session[:tour] = true if @photourls.count.eql?(0)
    end
    logger.debug conditions = { user_id: FriendMap.where(user_id:  current_user.id).pluck(:friend_id) }