app/controllers/image_playlists_controller.rb

  def index
    @playlists = [] || current_user.image_playlists.association_includer
    @image_items = current_user.image_items.includes(:itemizable => [:tags, :content_control]).order("items.created_at DESC")
    @playlist = current_user.image_playlists.where(social_network: 'AllPhotos').first
---
SELECT "items".* FROM "items" INNER JOIN "playlists" ON "items"."playlist_id" = "playlists"."id" WHERE "playlists"."type" IN ('ImagePlaylist') AND "playlists"."user_id" = 1 ORDER BY items.created_at DESC
SELECT id, name, social_network FROM "playlists" WHERE "playlists"."type" IN ('ImagePlaylist') AND "playlists"."user_id" = 1 ORDER BY created_at desc
SELECT "playlists".* FROM "playlists" WHERE "playlists"."type" IN ('ImagePlaylist') AND "playlists"."user_id" = 1 AND "playlists"."social_network" = 'AllPhotos' LIMIT 1

  def recent
    @playlist = current_user.image_playlists.where(social_network: 'RecentPhotos').first
    @image_items = current_user.image_items.includes(:itemizable => [:tags, :content_control]).limit(20)
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."type" IN ('ImagePlaylist') AND "playlists"."user_id" = 4 AND "playlists"."social_network" = 'RecentPhotos' LIMIT 1
SELECT "items".* FROM "items" INNER JOIN "playlists" ON "items"."playlist_id" = "playlists"."id" WHERE "playlists"."type" IN ('ImagePlaylist') AND "playlists"."user_id" = 4 LIMIT 20

  def show
    if request.fullpath.in? %w(/facebook /instagram /googleplus /twitter /flickr)
      network = request.fullpath == '/googleplus' ? 'Picasa' : request.fullpath[1..100].capitalize
      @playlist = current_user.image_playlists.where(social_network: network).first
      @show_feed = false
    else
      @playlist = current_user.image_playlists.where(:id => params[:id]).includes(:items => [:itemizable => :content_control]).first
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."type" IN ('ImagePlaylist') AND "playlists"."user_id" = 3 AND "playlists"."social_network" = 'Facebook' LIMIT 1
SELECT "items".* FROM "items" INNER JOIN "playlists" ON "items"."playlist_id" = "playlists"."id" WHERE "playlists"."type" IN ('ImagePlaylist') AND "playlists"."user_id" = 3 AND "items"."playlist_id" = 23