app/controllers/photo_networks_controller.rb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."type" IN ('ImagePlaylist') AND "playlists"."user_id" = 3 AND "playlists"."social_network" = 'MyPhotos' LIMIT 1
---
  def uploader
    @upload_photo = UploadedPhoto.new
    @uploaded_photos = current_user.uploaded_photos
    @playlist_show = current_user.image_playlists.where(social_network: 'MyPhotos').first