app/controllers/photo_urls_controller.rb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."type" IN ('ImagePlaylist') AND "playlists"."user_id" = 4 AND "playlists"."social_network" = 'URL' LIMIT 1
SELECT "items".* FROM "items" INNER JOIN "playlists" ON "items"."playlist_id" = "playlists"."id" WHERE "playlists"."type" IN ('ImagePlaylist') AND "playlists"."user_id" = 4 AND "items"."playlist_id" = 39
---
  def new
    @photo_url = current_user.photo_urls.build
    @playlist = current_user.image_playlists.where(social_network: 'URL').first
    @image_items = current_user.image_items.includes(:itemizable => [:tags, :content_control]).where(playlist_id: @playlist.id)