app/controllers/profile_photos_controller.rb

  def upload_photos
    if (@profile_photo = current_user.profile_photo)
      result = @profile_photo.update_attributes :profile_photo => params[:profile_photo][:profile_photo]
    else
      @profile_photo = ProfilePhoto.new(:profile_photo => params[:profile_photo][:profile_photo])
      @profile_photo.user = current_user
      result = @profile_photo.save
---
INSERT INTO "profile_photos" ("created_at", "profile_photo_content_type", "profile_photo_file_name", "profile_photo_file_size", "profile_photo_updated_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"