app/controllers/services_controller.rb

  def facebook
    auth = request.env['omniauth.auth']
    if current_user
      current_user.add_or_update_social_service_from_omniauth(auth)
      # sync social network data, just for facebook, because the user has already been login
      Service.delay.facebook current_user
      redirect_to facebook_url
    else
      user = User.find_or_create_from_omniauth(auth)
---
INSERT INTO "users" ("approved", "city", "comment_count", "confirmation_sent_at", "confirmation_token", "confirmed_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "deleted_at", "email", "embed_code_privacy", "encrypted_password", "first_name", "last_name", "last_sign_in_at", "last_sign_in_ip", "location", "no_need_confirm", "player_description", "player_title", "player_token", "privacy", "provider", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "uid", "unconfirmed_email", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32) RETURNING "id"

  def twitter
    auth = request.env['omniauth.auth']
    if current_user
      current_user.add_or_update_social_service_from_omniauth(auth)
      # sync social network data, just for twitter
      Service.delay.twitter current_user
      redirect_to twitter_url
    else
      user = User.find_by_provider_and_uid(auth[:provider], auth[:uid])
      if user
        user.add_or_update_social_service_from_omniauth(auth)
        unless user.approved
          redirect_to '/users/sign_in', :notice => I18n.t('devise.sessions.user.not_approved')
          return
        end
        # sync social network data, for all social network
        SocialWorker.perform_async user.id
        # refresh google token
        RefreshOauthWorker.perform_async user.id
        sign_in_and_redirect user, notice: "Signed in!"
      else
        if User.unscoped.find_by_provider_and_uid(auth[:provider], auth[:uid]).present?
          redirect_to '/users/sign_in', :notice => I18n.t('devise.sessions.user.deleted')
          return
        end
        twitter_user = TwitterUser.create(:twitter_user => auth)
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."provider" = 'twitter' AND "users"."uid" = '2182034312' LIMIT 1
INSERT INTO "twitter_users" ("created_at", "twitter_user", "updated_at") VALUES ($1, $2, $3) RETURNING "id"