app/controllers/users_controller.rb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."type" IN ('ImagePlaylist') AND "playlists"."user_id" = 4 AND (social_network is null or social_network not in ('AllPhotos','RecentPhotos','MyPhotos','URL'))
SELECT "playlists".* FROM "playlists" WHERE "playlists"."type" IN ('MusicPlaylist') AND "playlists"."user_id" = 4
SELECT "friend_maps".* FROM "friend_maps" WHERE "friend_maps"."user_id" = 4 LIMIT 6
---
  def show
    @image_playlists =  @user.image_playlists.where(:social_network => %w(AllPhotos RecentPhotos MyPhotos URL))
    @playlists = @user.playlists
    @image_lists = @user.image_playlists.where('social_network is null or social_network not in (?)', %w(AllPhotos RecentPhotos MyPhotos URL)).to_a.sort { |x, y| (Playlist::NAME_VALUE_HASH[y.social_network] || 0) <=> (Playlist::NAME_VALUE_HASH[x.social_network] || 0) }
    @video_lists = @user.video_playlists.where('social_network is null or social_network not in (?)', %w(AllVideos RecentVideos MyVideos VideosURL)).to_a.sort { |x, y| (Playlist::NAME_VALUE_HASH[y.social_network] || 0) <=> (Playlist::NAME_VALUE_HASH[x.social_network] || 0) }
    @audio_lists = @user.music_playlists.to_a.sort { |x, y| (Playlist::NAME_VALUE_HASH[y.social_network] || 0) <=> (Playlist::NAME_VALUE_HASH[x.social_network] || 0) }

    @friends = @user.friend_maps.includes(:friend).limit(6).map { |map| map.friend }

SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def user_comments
    @user = User.find params[:id]

SELECT "twitter_users".* FROM "twitter_users" WHERE "twitter_users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "users" ("approved", "city", "comment_count", "confirmation_sent_at", "confirmation_token", "confirmed_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "deleted_at", "email", "embed_code_privacy", "encrypted_password", "first_name", "last_name", "last_sign_in_at", "last_sign_in_ip", "location", "no_need_confirm", "player_description", "player_title", "player_token", "privacy", "provider", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "uid", "unconfirmed_email", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32) RETURNING "id"
---
  def create_twitter_user
    twitter_user_id = session[:twitter_user_id]
    auth = TwitterUser.find(twitter_user_id).twitter_user
    @user = User.create_from_twitter auth, params[:email], twitter_user_id