app/controllers/video_playlists_controller.rb

  def index
    @uploaded_videos = current_user.uploaded_videos.limit(12).offset(0)
    @video_urls = current_user.video_urls.limit(12).offset(0)
    @playlists = current_user.video_playlists.where('social_network in (?)', %w(Youtube))
    @playlist = current_user.video_playlists.where(social_network:  'AllVideos').first_or_create(name: "All Videos")
---
SELECT "uploaded_videos".* FROM "uploaded_videos" WHERE "uploaded_videos"."user_id" = 10 LIMIT 12 OFFSET 0
SELECT "video_urls".* FROM "video_urls" WHERE "video_urls"."user_id" = 10 ORDER BY created_at desc LIMIT 12 OFFSET 0
SELECT "playlists".* FROM "playlists" WHERE "playlists"."type" IN ('VideoPlaylist') AND "playlists"."user_id" = 10 AND "playlists"."social_network" = 'AllVideos' LIMIT 1
INSERT INTO "playlists" ("background_music_id", "background_music_title", "background_music_type", "background_music_url", "cover_image_content_type", "cover_image_file_name", "cover_image_file_size", "cover_image_source", "cover_image_updated_at", "created_at", "delay_second", "items_count", "name", "player_id", "set_feed", "slide_show", "social_network", "transition", "type", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"