app/views/friend_maps/_requests.html.erb

<% @request_friends.map {|friend| friend.user }.each do |user| %>
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = 1 LIMIT 1