app/views/player/items_new/_videos.html.erb

        <%# there is only youtube playlist here %>
        <% playlist.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."playlist_id" = 43